from aiogram import Router, F, types

from settings import config

router = Router()


@router.callback_query(F.data == 'about_company')
async def about_company(callback_query: types.CallbackQuery):
    about_company_text = (
        f"""
🪑 <b>О компании</b>

Наша мастерская мебели — это команда профессионалов, создающих мебель с душой и вниманием к каждой детали. 
Мы изготавливаем широкий ассортимент изделий: корпусную, мягкую, кухонную, офисную и декоративную мебель под заказ.

✨ Мы работаем с натуральными и экологичными материалами, применяем современные технологии 
и гарантируем долговечность каждой модели. От простых минималистичных решений до дизайнерских проектов — 
мы воплощаем любые идеи, сохраняя баланс между эстетикой, комфортом и качеством.

📦 <b>Что мы предлагаем:</b>
• Индивидуальные проекты под размеры заказчика
• Большой выбор материалов и фурнитуры
• Гарантию 2 года на всю продукцию
• Быструю доставку по России и СНГ

💬 Хотите оформить заказ или обсудить проект? Мы всегда на связи!

📲 <b>Связаться с нами:</b>
WhatsApp: https://wa.me/+{config.NUMBER}
Telegram: https://t.me/{config.TELEGRAM}

🤖 <b>Хотите заказать Telegram-бота или другое IT-решение?</b>
Обращайтесь: https://instagram.com/{config.DEVELOPMENT}
    """
    )

    await callback_query.message.edit_text(about_company_text, disable_web_page_preview=True)
